"""У вас є текстовий файл, який містить інформацію про місячні заробітні плати розробників у вашій компанії.
Кожен рядок у файлі містить прізвище розробника та його заробітну плату, які розділені комою без пробілів.
Наприклад:
Alex Korp,3000 Nikita Borisenko,2000 Sitarama Raju,1000
Ваше завдання - розробити функцію total_salary(path), яка аналізує цей файл і повертає загальну та середню суму заробітної плати всіх розробників.
"""
with open("salary_data.txt", "w", encoding="utf-8") as file:
    file.write("Alex Korp,3000 Nikita Borisenko,2000 Sitarama Raju,1000") # Створення файлу з даними про зарплати розробників

with open("salary_data.txt", "r", encoding="utf-8") as file:
    text = file.read() # Читання вмісту файлу
entries = text.strip().split()  # Розбиває текст за пробілами
for entry in entries:
    name, salary = entry.split(",")  # Розбиваємо кожну пару за комою
    print(f"{name} отримує {salary} $")







"""Критерії оцінювання:
1. Функція повинна точно обчислювати загальну та середню суми.
2. Повинна бути обробка випадків, коли файл відсутній або пошкоджений.
3. Код має бути чистим, добре структурованим і зрозумілим."""